Tekla.Structures.Plugins.DrawingPluginBase
The DrawingPluginBase class is an abstract base class for drawing plug-ins.

Tekla.Structures.Plugins.DrawingPluginBase.Run(System.Collections.Generic.List{Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition})
The main method of the plug-in. It is called after the input has been defined with
DefineInput(). This is the "main" method of the plug-in and should contain all the actual
implementation.
Input: An array list of the same format and order as what was returned from
DefineInput().
Returns: True on success.

Tekla.Structures.Plugins.DrawingPluginBase.DefineInput
The method Tekla Structures calls for the plug-in to query the input.
The plug-in must then return an array list of input definition instances. The plug-in
will be dependent on the items it returns. Dependent means that if any of these
items change, for example the user moves the points, the plug-in will be re-run with new
input. DefineInput is not called during the re-run, and thus all the actual implementation
should be in the Run() method. The Run() method is always called in view coordinates.
Returns: An array list of input definition instances. If the plug-in is not dependent on input, it
should return an empty array list (not null).

Tekla.Structures.Plugins.DrawingPluginBase.IsDefaultValue(System.Int32)
Returns true if the given value is set to the default value for this type.
Value: The value to test.
Returns: True if the value is set to the default.

Tekla.Structures.Plugins.DrawingPluginBase.IsDefaultValue(System.Double)
Returns true if the given value is set to the default value for this type.
Value: The value to test.
Returns: True if the value is set to the default.

Tekla.Structures.Plugins.DrawingPluginBase.IsDefaultValue(System.String)
Returns true if the given value is set to the default value (empty string).
Value: The value to test.
Returns: True if the value is set to the default.